---
kind: type
id: T:Autodesk.Revit.DB.SlabEdgeType
source: html/0f6f73b4-26b9-044e-590c-ef65a1210db8.htm
---
# Autodesk.Revit.DB.SlabEdgeType

An object that represents the slab edge type
in Autodesk Revit.

## Syntax (C#)
```csharp
public class SlabEdgeType : HostedSweepType
```